<a href="https://colab.research.google.com/github/werowe/HypatiaAcademy/blob/master/basics/sqllite_getting_started.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#SQL Lite 3


SQL Light is the world's most popular database.  It is designed to be very small.  It in in every iPhone and Android phone, for example.

We can use Python to work with it.  But even with Python the way we work with it is with SQL.  Below we show some of the most common SQL commands.

Data is stored in **rows** and **columns**.

The [documentation is here](https://www.sqlite.org/lang.html)/


# So Many Databases

* Oracle
* MySQL
* PostgreSQL
* MongoDB
* Cassandra
* Google Big Table
* Microsoft SQL Server
* Redis
* ElasticSearch
* IBM DB2
* MariaDB

In [1]:
#!pip list| grep "pretty"

prettytable                              3.11.0

In [12]:
#!pip install "prettytable==3.11.0"

Collecting prettytable==3.11.0
  Downloading prettytable-3.11.0-py3-none-any.whl.metadata (30 kB)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.12/dist-packages (from prettytable==3.11.0) (0.2.14)
Downloading prettytable-3.11.0-py3-none-any.whl (28 kB)
Installing collected packages: prettytable
  Attempting uninstall: prettytable
    Found existing installation: prettytable 3.17.0
    Uninstalling prettytable-3.17.0:
      Successfully uninstalled prettytable-3.17.0
Successfully installed prettytable-3.11.0

In [2]:
# load SQL command line interepreter

%load_ext sql

In [3]:
# create or connect to database

%sql sqlite:///students.db

In [5]:
# list files to show it was created

!ls

sample_data  students.db

# schema

a SQL database has a schema.  that means you tell it what attribute it has.

a noSQL database has no schema.  That means you can put different types on data in the the database


primary key is the main number for some object
you could either make up a number of use autoincremenet. and let the database do that

In [4]:
%%sql


CREATE TABLE students
  (
    studentnumber INTEGER PRIMARY KEY AUTOINCREMENT,
    studentname text,
    phonenumber text,
    email text,
    datecreated text
  );

 * sqlite:///students.db
(sqlite3.OperationalError) table students already exists
[SQL: CREATE TABLE students
  (
    studentnumber INTEGER PRIMARY KEY AUTOINCREMENT,
    studentname text,
    phonenumber text,
    email text,
    datecreated text
  );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [15]:
# add user to table.  Notice that we want the datecreated to be the current epoch time


%%sql

INSERT INTO students (studentname, phonenumber, email, datecreated)
VALUES ('William Shakespeare',"555-1212", "will@globe.uk.com", strftime('%s', 'now'));

 * sqlite:///students.db
1 rows affected.

[]

# insert

you use this format:


```
insert into table_name (column 1, column 2, ...)
values ('value 1', ' value 2', ...)

```

or some function like `strftime('%s', 'now')`

In [11]:
%%sql


INSERT INTO students (studentname, phonenumber, email, datecreated)
VALUES ('Thomas Mann',"555-1212", "a@a.com", strftime('%s', 'now'));

 * sqlite:///students.db
1 rows affected.

[]

This is the simplest form of lookin up data.  You write

```
select columns 1, column 2, ... from what_table where some-logic

```

In [5]:
# list rows in table
%%sql

select * from students;

 * sqlite:///students.db
Done.

[(1, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1765298339'),
 (2, 'Thomas Mann', '555-1212', 'a@a.com', '1765298347')]

# SQL lookup

```
select * from students where some_column = some_value
```

In [20]:
# find by column value

%%sql

select * from students where email="a@a.com";

 * sqlite:///students.db
Done.

[(2, 'Thomas Mann', '555-1212', 'a@a.com', '1765298347'),
 (3, 'Thomas Mann', '555-1212', 'a@a.com', '1765298967'),
 (4, 'Thomas Mann', '555-1212', 'a@a.com', '1765298968'),
 (5, 'Thomas Mann', '555-1212', 'a@a.com', '1765298969'),
 (6, 'Thomas Mann', '555-1212', 'a@a.com', '1765298970')]

# cursor

a cursor is an object that contains more than one row.  so we can iterate over it.


# Python

no we switch to python

In [16]:

import sqlite3

conn = sqlite3.connect("students.db")

cursor = conn.cursor()

# get all students

sql="select * from students";


cursor.execute(sql)

#this will return all records from the "customers" table
rows = cursor.fetchall()

#check if rows were found and print them
if rows:
    print("Students Records:")
    for row in rows:
        print(row)
else:
    print("No records found.")

#save the changes
conn.commit()

#close the connection
conn.close()

Students Records:
(1, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1765298339')
(2, 'Thomas Mann', '555-1212', 'a@a.com', '1765298347')
(3, 'Thomas Mann', '555-1212', 'a@a.com', '1765298967')
(4, 'Thomas Mann', '555-1212', 'a@a.com', '1765298968')
(5, 'Thomas Mann', '555-1212', 'a@a.com', '1765298969')
(6, 'Thomas Mann', '555-1212', 'a@a.com', '1765298970')
(7, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1765298973')
(8, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1765298974')
(9, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1765298975')
(10, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1765298975')

In [27]:
%%sql


SELECT count(*)
FROM students
WHERE studentname LIKE '%Mann%';

 * sqlite:///students.db
Done.

[(5,)]

In [31]:
%%sql
select studentname, phonenumber
from students
order by studentname

 * sqlite:///students.db
Done.

[('David Foster Wallace', '555-1212'),
 ('David Foster Wallace', '555-1212'),
 ('David Foster Wallace', '555-1212'),
 ('David Foster Wallace', '555-1212'),
 ('David Foster Wallace', '555-1212'),
 ('William Shakespeare', '555-1212'),
 ('William Shakespeare', '555-1212'),
 ('William Shakespeare', '555-1212'),
 ('William Shakespeare', '555-1212'),
 ('William Shakespeare', '555-1212')]

In [ ]:
# delete all rows in table
%%sql

delete from students;

   sqlite:////students.db
 * sqlite:///students.db
3 rows affected.

[]

In [30]:
# update data

%%sql

UPDATE students
SET studentname = "David Foster Wallace"
WHERE email = "a@a.com";

 * sqlite:///students.db
5 rows affected.

[]

In [ ]:
# delete whole table

%%sql

drop table students

   sqlite:////students.db
 * sqlite:///students.db
Done.

[]

# Homework


Make up your own data and run some SQL commans on it.